# 1. На улице встретились N друзей. Каждый пожал руку всем остальным друзьям (по одному разу). Сколько рукопожатий было?
# Примечание. Решите задачу при помощи построения графа.


def count_edge(num_vertex):
	graph = [[0 if vertex == edge else 1 for edge in range(num_vertex)] for vertex in range(num_vertex)]
	# каждый друг пожал руку каждому кроме себя, не учитываются также повторные рукопожатия, в графе это выглядит так
	# [[0, 1, 1, 1, 1], [1, 0, 1, 1, 1], [1, 1, 0, 1, 1], [1, 1, 1, 0, 1], [1, 1, 1, 1, 0]] - если 5 друзей
	res_sum = 0
	for vtx in graph:
		res_sum += sum(vtx)
	return int(res_sum / 2)  # т.к рукопожатия учитывались дважды


num_friends = int(input('Введите кол-во друзей: '))
print(f'Кол-во рукопожатий : {count_edge(num_friends)}')
