# 2. Во втором массиве сохранить индексы четных элементов первого массива. Например,
# если дан массив со значениями 8, 3, 15, 6, 4, 2, второй массив надо заполнить значениями 0, 3, 4, 5
# (помните, что индексация начинается с нуля), т. к. именно в этих позициях первого массива стоят четные числа.

import random

list1 = [random.randint(1, 100) for _ in range(20)]
print(f'Исходный список: {list1}')

list_even = [idx for idx, el in enumerate(list1) if el % 2 == 0]
print(f'Четные индексы: {list_even}')