# Написать программу, доказывающую или проверяющую, что для множества натуральных чисел выполняется равенство:
# 1+2+...+n = n(n+1)/2, где n — любое натуральное число.

n = int(input('Input n: '))

sum = 0
for i in range(1, n + 1):
	sum += i

print(f'{sum} = {n * (n + 1) / 2}')

# easy way
# print(sum(range(1, n + 1)))