# 4. Найти сумму n элементов следующего ряда чисел: 1, -0.5, 0.25, -0.125,… Количество элементов (n) вводится с клавиатуры.

n = int(input('Введите кол-во элементов: '))
sum = 0
num = -2

while n > 0:
	num /= -2
	sum += num
	n -= 1

print('Сумма элементов: ', sum)
